{
  "name": "About Alexis",
  "headline": "About Alexis",
  "isVisible": true,
  "filename": "about.json",
  "text": "Hi, I’m Alexis Córdova (alex-*ees* cord-ova) and I’m a front-end developer living in San Francisco, CA. My primary focus is creating responsive component libraries and user interfaces for web-enabled devices, which, to me, really means I enjoy building things that are easy to use and work with—for both end users and developers alike. Since graduating from San Francisco State University with a degree in Digital Media (with an emphasis on interaction design, information architecture, and user experience), I’ve worked for various companies and agencies, working on projects ranging from marketing websites and style guides to single-page web applications, web frameworks, and complete site redesigns.\n\nI started in the web development game around 1996 (The Internet Archive states my first website was in 1998, but that feels late to me) when I shamelessly stole other people’s source code and changed their HTML `<table>` and `<font>` tags to see what would happen. Since this is now The Future™, I’ve moved on to more modern approaches—HTML5, CSS 3, Sass, and JavaScript frameworks like React.js and Ember.js—focusing on web application and framework development.\n\nI truly believe that “working smart” is a lot more important and fruitful than simply “working hard.” Because of this, I am a huge proponent of tools like Webpack, Vagrant (or Docker), and continuous integration, and design tools like Sketch. I also wholeheartedly believe that building component libraries and [front-end UI systems](https://blog.intercom.com/the-full-stack-design-system/) are **the** ways to “work smart” today. As a user interface developer, I’m not particularly interested in algorithms or solving puzzlers (even though I fully respect those who do); what I am very focused on is creating components that are responsive, accessible, performant, and well thought out. This is very hard work! But when done successfully (and in concert with other relevant teams in the organization), composing views for your site or application becomes a breeze.\n\nSome believe this type of approach is more design than development or engineering, but since I believe “design” is “problem solving,” [everything a design task](https://library.gv.com/everyone-is-a-designer-get-over-it-501cc9a2f434) to me.\n\nWhen I’m not coding or at the computer, there’s a good chance I’ll be locked in on a San Francisco Giants or Golden State Warriors game, taking photos with my Sony NEX-5T or (more likely) my iPhone 7, or enjoying a nice cup of coffee (espresso please!). Despite living in the city my entire life, I love the wilderness. I recently created a retro gaming machine with a Raspberry Pi, so Mike Tyson’s Punch-Out and Super Mario Bros 3 has been taking up a lot of my free time.\n\n### Contact Information\n- **Email**: [alexis@alexiscordova.com](mailto://alexis@alexiscordova.com)\n- **Twitter**: [@acordova](https://twitter.com/acordova)\n- **LinkedIn**: [acordova](https://www.linkedin.com/in/acordova/)\n- **CodePen**: [acordova](http://codepen.io/acordova/)\n- **GitHub**: [alexiscordova](https://github.com/alexiscordova)\n- **Instagram**: [@hellacutty](https://instagram.com/hellacutty)"
}