{
  "name": "About Alexis",
  "headline": "About Alexis",
  "isVisible": true,
  "filename": "about.json",
  "text": "Hi, I’m Alexis Córdova (alex-*ees* cord-ova) and I’m a front-end web developer based in Portland, OR (originally from San Francisco, CA). My primary focus is creating responsive design systems and user interfaces for web-enabled devices, which to me really means I enjoy building things that are easy to use and work with—for both end users and developers alike. Since graduating from San Francisco State University with a degree in Digital Media (with an emphasis on interaction design, information architecture, and user experience), I’ve worked for various companies and agencies, working on projects ranging from marketing websites and style guides to single-page web applications, web frameworks, and complete site redesigns.\n\nI would not, and do not, categorize myself as an \"engineer\"; I don't revel in algorithmic logic and have never studied Computer Science or its principles. Instead, I consider myself a \"developer,\" be it for websites or web applications. I enjoy working with designers and product teams—leveraging each discipline's strengths—to craft the best user experience possible.\n\nI started in the web development game around 1996 (The Internet Archive states my first website was in 1998, but that feels late to me) when I shamelessly stole other people’s source code and changed their HTML `<table>` and `<font>` tags to see what would happen. Since this is now The Future™, I’ve moved on to more modern approaches—standards-based HTML, CSS/Sass, ES2015+, and JavaScript frameworks like React.js—focusing on web application and framework development.\n\nI truly believe that “working smart” is a lot more important and fruitful than simply “working hard.” I also wholeheartedly believe that building component libraries and [design systems](https://blog.intercom.com/the-full-stack-design-system/) are **the** ways to “work smart” today. As a user interface developer, I’m not particularly interested in algorithms or solving puzzlers (even though I fully respect those who do); what I am very focused on is creating components and systems that are responsive, accessible, performant, and well thought out. This is very hard work! But when done successfully (and in concert with other relevant teams in the organization), building sites and applications becomes a breeze.\n\nWhen I’m not at the computer, there’s a good chance I’ll be locked in on a San Francisco Giants or Golden State Warriors game, working on restoring my 105 year old Craftsman Bungalow, or playing with my daughter.\n\nI can best be reached via [email](mailto:alexis@alexiscordova.com). Drop me a line.\n\n### Contact Information\n- **Email**: [alexis@alexiscordova.com](mailto:alexis@alexiscordova.com)\n- **Twitter**: [@acordova](https://twitter.com/acordova)\n- **LinkedIn**: [in/acordova](https://www.linkedin.com/in/acordova/)\n- **CodePen**: [@acordova](http://codepen.io/acordova/)\n- **GitHub**: [@alexiscordova](https://github.com/alexiscordova)\n- **Instagram**: [@hellacutty](https://instagram.com/hellacutty)"
}