{"name":"About Alexis","filename":"about.json","text":"### About Alexis\nHi, I’m Alexis Córdova (alex-ees cord-ova) and I’m a front-end UI/UX developer currently living in San Francisco, CA. My primary focus is creating responsive, modular, and performant experiences for web-enabled devices, which is really just a fancy way of saying I really like building things that are easy to use and work well—for both end users and developers. Since graduating from San Francisco State University with a degree in digital media (focusing on interaction design, information architecture, and user experience), I’ve worked for various companies—and dabbled in the agency world—working on projects ranging from marketing pages and living style guides to single-page applications, web frameworks, and site redesigns and re-architectures.\n\nI started in the web-development game around 1996, when I blatantly stole other people’s code and changed their HTML tables and font tags simply to see what would happen. Since this is now the future, I’ve moved onto HTML5, CSS 3, Sass (SCSS), and JavaScript—more recently focusing on web application and framework development. I truly believe “working hard” is less important than “working smart,” so I’m a big proponent of tools like Grunt and Gulp, and prefer design tools like Sketch over Photoshop (although I am proficient in both).\n\nBeing a huge baseball and San Francisco Giants fan, I created [Is It Baseball Season Yet](http://isitbaseballseasonyet.com). During the offseason, the site displays a simple timer counting down the days until the first game of the baseball season; during the season, however, the site changes into an interactive scoreboard powered by Angular.js (or Ember.js, depending on my mood) and the MLB GameDay API, which powers the MLB At-Bat app.\n\nWhen I’m not working or at my computer, there’s a good chance you’ll find me taking photos with my iPhone or NEX-5T, bicycling around the city, drinking an obscene amount of espresso, or yelling at the TV over something sports related. I recently purchased a PS4, so now Fallout 4 is taking up a lot of my free time.\n\n### Contact Information\n- __Email__: [alexis@alexiscordova.com](mailto://alexis@alexiscordova.com)\n- __Twitter__: [@acordova](https://twitter.com/acordova)\n- __LinkedIn__: [acordova](https://www.linkedin.com/in/acordova/)\n- __CodePen__: [acordova](http://codepen.io/acordova/)\n- __GitHub__: [alexiscordova](https://github.com/alexiscordova)\n- __Instagram__: [@hellacutty](https://instagram.com/hellacutty)"}