{
  "name": "Content Cloud Introduction",
  "id": "content-cloud-introduction",
  "isVisible": true,
  "filename": "content-cloud-introduction.json",
  "headline": "Thismoment Content Cloud",
  "text": "Content Cloud is a web-based content management system and front–end site generator, allowing users to source and curate any owned or user-generated (social media) content, mix that content by creating custom playlists, and distribute those playlists to a wide variety of social networks and/or owned domains.\n\nTo power Content Cloud, we created and maintained an in–house framework (similar to Backbone.js), as well as leveraging other front–end technologies and our own APIs. We also used third-party APIs—Facebook, Instagram, YouTube, Twitter, PublishThis, and Sprinklr—to allow users to pull in external content for their marketing needs. Playlists (collections of content) could then be shared externally using our pre-built layouts or by using our APIs to build custom solutions. Some examples include: supplimental product information from an in-store visit to a retailer, and personalized customer support content sent to a customer's mobile device. \n\nWhile initially desktop only, I took the lead in implementing a responsive, mobile–first workflow which allowed us to make Content Cloud available on any web–enabled device; we were then able to refine the user interface and user interactions throughout the application. I also was the resident CSS expert—focusing on reducing and simplifying our LESS code, as well as improving general browser performance—and front-end automation expert, using Grunt to simplify build tasks and make development more hassle-free.\n\nContent Cloud launched in early 2014, and is being used by such companies as Salesforce, Sephora, and Google.\n\n- **Client**: Thismoment\n- **Technology**: HTML5, CSS 3, LESS, Twitter Bootstrap, jQuery, Underscore, Require.js; Proprietary JavaScript Framework; Content Cloud API\n- **Responsibilities**: Development, Responsive Design/Development, Platform Engineering\n- **Website**: [thismoment.com/platform/](http://www.thismoment.com/platform/)"
}