{
  "name": "Is It Baseball Season Yet Introduction",
  "id": "iibbsy-introduction",
  "isVisible": true,
  "filename": "iibbsy-introduction.json",
  "headline": "Is It Baseball Season Yet",
  "text": "Is It Baseball Season Yet is a sports side project originally created as an attempt to pass the time during the Major League Baseball offseason.\n\nDuring the offseason (and pre-season), a counter is displayed counting down the days, hours, minutes, and seconds until the first game of the upcoming MLB season. This is particularly popular on Twitter with people like myself who need to know *exactly* how much time remains until the season starts.\n\nDuring the season, the countdown is replaced with a scoreboard of the day's games. The data is retrieved from the official MLB Advanced Media (MLBAM) JSON feed—the same data used to power MLB At Bat and MLB Gameday—and is consumed by an Ember.js app.\n\nUnfortunately, the MLB API is not publicly documented, and therefore the data response is quite messy. Because of this, the initial focus was to decode many of the statuses, as well as standardizing everything, that could be returned by the API. Even more unfortunately, this means waiting for specific semi-rare events to happen *in an actual, real-life game* before you can develop code for that event. Because of this, every possible response is not accounted for, and the design is quite bare bones. As they say in baseball, “you see something new every day,” which is not what you want to hear when you're trying to debug an app.\n\nIronically, this app is not currently live despite it truly being baseball season. Since a lot has changed (in the tech world) from the previous baseball season, I'm now considering updating Is It Baseball Season Yet to a React.js app (with a Node/Express back end that standardizes the MLB API), but only as time permits (which it hasn't as of yet).\n\n- **Client**: Alexis Córdova\n- **Technology**: HTML5, Sass (SCSS), Ember.js; MLBAM API\n- **Responsibilities**: Design, Development\n- **Website**: [Is It Baseball Season Yet](http://isitbaseballseasonyet.com)\n- **Code**: [Countdown Timer](https://github.com/alexiscordova/iibbsy-countdown), [Ember.js App](https://github.com/alexiscordova/iibbsy)"
}