{
  "name": "Portfolio Introduction",
  "id": "portfolio-introduction",
  "isVisible": true,
  "filename": "portfolio-introduction.json",
  "headline": "alexiscordova.com",
  "text": "The portfolio of Alexis Córdova (alexiscordova.com) is the site you’re on right now. Welcome! This is the fourth version of the site, and its primary purpose is to display some of the work I’ve done in my career, as well as serving as a sandbox to try different development tools and techniques.\n\nThis site has had a slew of technological approaches in the past, mainly ones that expanded experience I gained or refined at previous jobs. For version four, I took on the challenge of many using technologies that I had never used before, primarily React.js, Redux, Node.js (for basic server creation), Webpack 2, and NPM scripts.\n\nDespite my initial misgivings about React (hearing “you write your CSS in JavaScript!” still makes me cringe), I learned the fundamentals and was able to create a functioning prototype in about a day. I replaced Gulp.js with Webpack (initially version 1, but decided on version 2 for future proofing) and NPM scripts, which was refreshingly straightforward.\n\nMy biggest worry was writing Node.js. As a UI developer, back-end development isn't generally my definition of “fun.” But, in reality, Node.js is simply JavaScript with a different API, so I was able to pick it up pretty quickly. For content management (a term I use loosely), I settled on [Contentful](https://contentful.com), and after removing some of the “noise” from the API response, I was able to create data that was easy to work with within a React.js app.\n\nWhile I did rely heavily on my previous component library experience, I hadn‘t integrated that knowledge with React before; I was very happy to find out that the two work perfectly together. Honestly, despite many in the tech community seeing component library development as not “true” engineering, I truly believe this is the best way forward for web development.\n\n- **Client**: Alexis Córdova\n- **Technology**: React.js, Redux, Babel (ES2015+), Node.js (Express.js), Sass (SCSS), HTML5, Webpack 2, NPM, Amazon Web Services, Contentful\n- **Responsibilities**: Development and everything else possible\n- **Code**: [GitHub](https://github.com/alexiscordova/alexiscordova.com)\n"
}