{
  "name": "SAF Introduction",
  "id": "saf-introduction",
  "isVisible": true,
  "filename": "saf-introduction.json",
  "headline": "SAF Group",
  "text": "[Strategic Alternative Funds (SAF) Group](https://safplatform.com) is a financial-technology company in New York City, focusing on making the trading of alternative funds—private equity, hedge funds, derivatives, etc.—easier through technology. SAF, working directly with key industry partners, helps remove many of the bottlenecks and regulatory paperwork headaches by creating a platform that not only walks you through the process of buying and trading these funds, but also sets your team up to be 100% digital.\n\nWhen SAF came to us in 2015, they had designs for every single page of their app (over 1,000!) but needed help turning those Sketch documents into a functioning prototype. Leveraging our experience at StubHub, we demonstrated and ultimately convinced SAF to instead take a component approach, which would not only allow for faster, more-robust development now, but also would make the platform more nimble. For example, instead of creating three different `<table>` components to account for the slight differences in the design comps, we could instead create one robust component that could be used anywhere within the platform.\n\nWorking with an Angular.js developer in Barcelona, we created roughly 15 components (which were turned into Angular Directives), along with a typography system and color palette. With these pieces, we were then able to create demo pages for each component, as well as representations of the original design comps. We worked together with SAF designers to create a tight feedback loop to address any bugs or design updates before they were handed off.\n\nAlong with our component library, we assisted in the creation of a Sketch style guide document, which outlined the design documentation, rules, and measurements of every component. This allowed additional designers to easily pick the system up, and allowed developers to be precise in their code.\n\n- **Client**: Strategic Alternative Funds (SAF) Group\n- **Technology**: Angular.js (v1), Sass (SCSS), HTML5, Bootstrap, Gulp, Jekyll\n- **Responsibilities**: Component Library Development, Prototyping, Testing & QA\n- **Code**: [GitHub](https://github.com/alexiscordova/saf)"
}