{
  "name": "StubHub Primer Introduction",
  "id": "stubhub-primer-introduction",
  "isVisible": true,
  "filename": "stubhub-primer-introduction.json",
  "headline": "StubHub Primer",
  "text": "In previous versions, [StubHub.com](https://stubhub.com)’s web platform was fragmented; each piece of the site used different technologies with very little shared code. In an effort to unify the development stack, the Unified Experience initiative was launched in 2014. While successful in unifying the stack, the code architecture and user interface unfortunately was still spread over the multiple silos, causing UI inconsistencies, unnecessary code duplication, and code bloat. The Brand Modernization initiative set out to remedy this by re–architecting the user interface with reusable components, while also re-designing each piece of the app.\n\nTo this end, the Standards and Governance team (one UX design manager, one UI designer, and myself) created Primer, a mobile–first UI/UX component framework based on [SMACSS](https://smacss.com) and [Atomic Design](http://atomicdesign.bradfrost.com/chapter-2/) methodologies. The goal of the framework was to create a strong foundation for the Brand Modernization initiative and bring UI consistency to the application. Once completed, this would then allow the UX Design team to rethink the design, and allow developers to easily apply those design changes. We focused on three key areas: base structural styles built on top of [normalize.css](http://necolas.github.io/normalize.css/), components built from small atomic elements, and file size and performance.\n\nPrimer consists of seven components (molecules) built using eight base elements (atoms)—including an [animation library](http://codepen.io/acordova/details/domQGq/), [a responsive typography system based in `rem`](http://codepen.io/acordova/details/qdomLx/), SVG icon set, and [a robust color system](http://codepen.io/acordova/details/jPeEZq/) with customizable scales—along with a responsive grid. While each component is built to the specifications declared in the Primer style guide, they are also content-aware and flexible enough to be modified with little to no additional code.\n\nAlong with the style guide and CSS framework, each portion of Primer comes with detailed documentation, allowing designers and developers to understand and apply the system. This allows the framework itself to be decoupled from any specific initiative, and allows any team to leverage Primer as their foundation. Because each piece of Primer is modular, teams can easily create custom builds containing only the parts they need for their project.\n\nTo create Primer, the Standards team worked together to implement our own design process: we collected every interface pattern on StubHub.com (as well as researching code techniques for creating our component library), we broke down each pattern to its core parts, and worked side-by-side to create a rapid design/development feedback loop. This not only allowed us to be intimately knowledgable with the entire system, but gave us the opportunity to fix issues as they occurred. This approach allowed us to have a working system within four months without sacrificing quality.\n\nIn many cases, components in Primer are ⅕ the size of their Unified counterparts. When compiled, Primer’s raw code files are 30% smaller than the entire Unified optimized code base.\n\n\n- **Client**: StubHub, Inc.\n- **Technology**: HTML5, CSS 3, Sass (SCSS), JavaScript; Grunt, Bower\n- **Responsibility**: Modular System Development, Style Guide Development, Prototyping, Design\n- **Demos**: [CodePen](http://codepen.io/collection/XOLjZm/)\n- **Code**: [GitHub](https://github.com/alexiscordova/primer)"
}