{"name":"StubHub Primer Introduction","id":"stubhub-primer-introduction","isVisible":true,"filename":"stubhub-primer-introduction.json","headline":"StubHub Primer","text":"In previous versions, StubHub.com’s web platform was fragmented; each piece of the site used different technologies, with very little shared code. In an effort to unify the development stack, the Unified Experience initiative was launched in 2014. While successful in unifying the stack, the CSS architecture and user interface unfortunately was still spread over the multiple silos that make up the app, causing UI inconsistencies and code bloat. The Brand Modernization initiative set out to remedy this by re–architecting the user interface with reusable components, while also re-designing each piece of the app.\n\nTo this end, the Standards and Governance team (one UX designer, one UI designer, and myself) created Primer, a mobile–first user–experience framework based on [SMACSS](https://smacss.com) and [Atomic Design](http://atomicdesign.bradfrost.com/chapter-2/) methodologies. The goal of the framework was to—using modern approaches with technologies such as HTML5, CSS3, Sass (SCSS), Grunt, and Bower—create a strong foundation for the Brand Modernization initiative and bring UI consistency to the application. We focused on three key areas: base structural styles built on top of [normalize.css](http://necolas.github.io/normalize.css/), components built from small atomic elements, and file size and performance.\n\nPrimer consists of seven components (molecules) built using eight base elements (atoms)—including an animation library, a responsive typography system based in rems, SVG icon set, and a robust color system with customizable scales—along with a responsive grid. While each component is built to the specifications declared in the Primer style guide, they are also content-aware and flexible enough to be modified with little to no additional code. In many cases, components in Primer are ⅕ the size of their Unified counterparts. When compiled, Primer’s non–gzipped CSS file is 30% smaller than the entire Unified CSS file gzipped.\n\nAlong with the style guide and CSS framework, each portion of Primer comes with detailed documentation, allowing designers and developers to understand and apply the system. This allows the framework itself to be decoupled from any specific initiative, and allows any team to leverage Primer as their foundation. Because each piece of Primer is modular, teams can easily create custom builds containing only the parts they need for their project.\n\nThe Brand Modernization initiative is currently ongoing.\n\n- **Client**: StubHub, Inc.\n- **Technology**: HTML5, CSS 3, Sass (SCSS), JavaScript; Grunt, Bower\n- **Responsibility**: Modular System Development, Style Guide Development, Prototyping, Design\n- **Website**: [CodePen](http://codepen.io/collection/XOLjZm/)"}